sdaiInsertNestedAggrByIndex(Sdai_Id_aggr*,System.UInt32)
\details
Inserts a new nested aggregate value into an application instance list at the position specified by an index.
\param list  [in] An application instance list.
\param index [in] An index value.
\returns The inserted aggregate value.